Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType
ConceptualConstructionType values for Floors.
Since:
2012
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.NumFloorSlabTypeConstruction
Total number of Floor/Slab Constructions

Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.HighMassConstructionTypicalNoInsulation
High Mass Construction Typical No Insulation Slab

Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.HighMassConstructionColdClimateSlabInsulation
High Mass Construction Cold Climate Insulation Slab

Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.HighMassConstructionFrigidClimateSlabInsulation
High Mass Construction Frigid Climate Insulation Slab

Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.LightweightConstructionNoInsulationInterior
Lightweight Construction No Insulation Interior Floor

Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.LightweightConstructionLowInsulation
Lightweight Construction Low Insulation Floor

Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.LightweightConstructionTypicalInsulation
Lightweight Construction Typical Insulation Floor

Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.LightweightConstructionHighInsulation
Lightweight Construction High Insulation Floor

Autodesk.Revit.DB.Analysis.ConceptualConstructionFloorSlabType.InvalidFloorSlabTypeConstruction
Invalid/not set Floor or Slab Type construction value